# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.12-s068_1 on Sun Apr 14 10:49:59 UTC 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design neural_nw_inference

create_clock -name "clk" -period 20.0 -waveform {0.0 10.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[32]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[33]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[34]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[35]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[36]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[37]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[38]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[39]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[40]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[41]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[42]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[43]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[44]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[45]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[46]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[47]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[48]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[49]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[50]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[51]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[52]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[53]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[54]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[55]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[56]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[57]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[58]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[59]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[60]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[61]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[62]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[63]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[64]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[65]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[66]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[67]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[68]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[69]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[70]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[71]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[72]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[73]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[74]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[75]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[76]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[77]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[78]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[79]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[80]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[81]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[82]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[83]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[84]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[85]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[86]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[87]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[88]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[89]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[90]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[91]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[92]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[93]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[94]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[95]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[96]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[97]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[98]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[99]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[100]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[101]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[102]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[103]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[104]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[105]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[106]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[107]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[108]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[109]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[110]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[111]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[112]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[113]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[114]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[115]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[116]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[117]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[118]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[119]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[120]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[121]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[122]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[123]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[124]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[125]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[126]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[127]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[128]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[129]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[130]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[131]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[132]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[133]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[134]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[135]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[136]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[137]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[138]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[139]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[140]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[141]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[142]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[143]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[144]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[145]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[146]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[147]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[148]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[149]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[150]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[151]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[152]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[153]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[154]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[155]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[156]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[157]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[158]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[159]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[160]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[161]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[162]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[163]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[164]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[165]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[166]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[167]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[168]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[169]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[170]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[171]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[172]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[173]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[174]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[175]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[176]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[177]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[178]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[179]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[180]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[181]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[182]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[183]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[184]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[185]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[186]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[187]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[188]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[189]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[190]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[191]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[192]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[193]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[194]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[195]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[196]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[197]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[198]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[199]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[200]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[201]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[202]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[203]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[204]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[205]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[206]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[207]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[208]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[209]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[210]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[211]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[212]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[213]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[214]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[215]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[216]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[217]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[218]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[219]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[220]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[221]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[222]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[223]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[224]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[225]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[226]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[227]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[228]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[229]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[230]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[231]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[232]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[233]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[234]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[235]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[236]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[237]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[238]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[239]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[240]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[241]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[242]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[243]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[244]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[245]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[246]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[247]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[248]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[249]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[250]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[251]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[252]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[253]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[254]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {test_img[255]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports done]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {predicted_val[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {predicted_val[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {predicted_val[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {predicted_val[3]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_ports clk]
set_clock_uncertainty -hold 0.01 [get_ports clk]
